# coding=utf8

__author__ = 'wangjiawei'
__date__ = '2018-03-15'

"""
    对于order.py 的作用是，收集大众点评的各个分类数据
    为生成url提供一个数据上的支撑
"""

CATEGORY = {
    "美食": {
        "日本菜": "ch10/g113",
        "家常菜": "ch10/g1783",
        "农家菜": "ch10/g25474",
        "下午茶": "ch10/g34014",
        "人气餐厅": "ch10/g34012",
        "水果生鲜": "ch10/g2714",
        "创意菜": "ch10/g250",
        "川菜": "ch10/g102",
        "菜馆": "ch10/g134",
        "面馆": "ch10/g215",
        "粤菜": "ch10/g103",
        "素菜": "ch10/g109",
        "火锅": "ch10/g110",
        "私房菜": "ch10/g1338",
        "烧烤": "ch10/g508",
        "咖啡厅": "ch10/g132",
        "海鲜": "ch10/g251",
        "小吃快餐": "ch10/g112",
        "韩国料理": "ch10/g114",
        "西餐": "ch10/g116",
        "自助餐": "ch10/g111",
        "其他美食": "ch10/g118",
    },
    "足疗洗浴": {
        "足疗按摩": "ch30/g141",
        "洗浴": "ch30/g140"
    },
    "玩乐": {
        "KTV": "ch15/g135",
        "酒吧": "ch15/g133",
        "茶馆": "ch15/g134",
        "文化艺术": "ch15/g142",
        "其他玩乐": "ch15/g26490"
    },
    "周边游": {
        "展馆展览": "ch35/g2926",
        "采摘": "ch35/g20038",
        "温泉": "ch35/g5672",
        "动植物园": "ch35/g2834",
        "水上娱乐": "ch35/g2916",
        "景点": "ch35/g33831",
        "其他周边游": "ch35/g33832",
    },
    "运动健身": {
        "健身中心": "ch45/g147",
        "游泳馆": "ch45/g151",
    },
    "购物": {
        "综合商场": "ch50/g119",
        "服饰鞋包": "ch50/g120",
        "运动户外": "ch50/g121",
        "珠宝饰品": "ch50/g122",
    },
    "交通": {
        "公交车": "ch80/g5146",
        "地铁": "ch80/g640",
        "汽车站": "ch80/g755",
        "火车站": "ch80/g723",
        "机场休息": "ch80/g34013",
        "港口": "ch80/g809",
        "飞机场": "ch80/g782",
        "其他交通": "ch80/g3080"
    },
}